performance-tools/ravana/wsclient/data/message2k.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"></soapenv:Header><soapenv:Body><m:buyStocks xmlns:m="http://po.services.core.carbon.wso2.org"><m:order><m:symbol>IBM</m:symbol><m:buyerID>asankha</m:buyerID><m:price>140.34</m:price><m:volume>200000</m:volume></m:order><m:order><m:symbol>MTDRSJ</m:symbol><m:buyerID>BXUTIH</m:buyerID><m:price>984907.49</m:price><m:volume>877939</m:volume></m:order><m:order><m:symbol>PAUCWY</m:symbol><m:buyerID>OLYSKA</m:buyerID><m:price>000289.07</m:price><m:volume>150346</m:volume></m:order><m:order><m:symbol>KBVVZG</m:symbol><m:buyerID>BFHLSH</m:buyerID><m:price>928106.12</m:price><m:volume>630356</m:volume></m:order><m:order><m:symbol>ZKXWDI</m:symbol><m:buyerID>XTAVXZ</m:buyerID><m:price>135501.34</m:price><m:volume>107545</m:volume></m:order><m:order><m:symbol>WMSXHV</m:symbol><m:buyerID>AFZBBQ</m:buyerID><m:price>949286.63</m:price><m:volume>369434</m:volume></m:order><m:order><m:symbol>DHELYU</m:symbol><m:buyerID>OQVCSZ</m:buyerID><m:price>846603.40</m:price><m:volume>140683</m:volume></m:order><m:order><m:symbol>MIYALT</m:symbol><m:buyerID>WHVFPG</m:buyerID><m:price>791501.34</m:price><m:volume>310787</m:volume></m:order><m:order><m:symbol>OMDUWE</m:symbol><m:buyerID>VXVPSG</m:buyerID><m:price>780427.07</m:price><m:volume>202470</m:volume></m:order><m:order><m:symbol>LBTJAO</m:symbol><m:buyerID>WNVWVN</m:buyerID><m:price>405155.94</m:price><m:volume>320615</m:volume></m:order><m:order><m:symbol>HAFTHX</m:symbol><m:buyerID>KOWELG</m:buyerID><m:price>595150.02</m:price><m:volume>409555</m:volume></m:order><m:order><m:symbol>YBDBHR</m:symbol><m:buyerID>TIHVQI</m:buyerID><m:price>010327.51</m:price><m:volume>265252</m:volume></m:order><m:order><m:symbol>ZSWRBR</m:symbol><m:buyerID>MSAMGE</m:buyerID><m:price>605400.14</m:price><m:volume>300960</m:volume></m:order></m:buyStocks></soapenv:Body></soapenv:Envelope>
