performance-tools/ravana/wsclient/data/message10k.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"></soapenv:Header><soapenv:Body><m:buyStocks xmlns:m="http://po.services.core.carbon.wso2.org"><m:order><m:symbol>IBM</m:symbol><m:buyerID>asankha</m:buyerID><m:price>140.34</m:price><m:volume>200000</m:volume></m:order><m:order><m:symbol>VUFCRO</m:symbol><m:buyerID>MRGMPD</m:buyerID><m:price>824544.85</m:price><m:volume>645909</m:volume></m:order><m:order><m:symbol>OGADQN</m:symbol><m:buyerID>OUNFIW</m:buyerID><m:price>181059.00</m:price><m:volume>240902</m:volume></m:order><m:order><m:symbol>BCQZGP</m:symbol><m:buyerID>VOUBNM</m:buyerID><m:price>209807.72</m:price><m:volume>632149</m:volume></m:order><m:order><m:symbol>GYINBV</m:symbol><m:buyerID>TOIMQS</m:buyerID><m:price>697867.66</m:price><m:volume>080922</m:volume></m:order><m:order><m:symbol>YXZPFS</m:symbol><m:buyerID>EGEORT</m:buyerID><m:price>056175.91</m:price><m:volume>207790</m:volume></m:order><m:order><m:symbol>YYNQHA</m:symbol><m:buyerID>AVWBCN</m:buyerID><m:price>690646.24</m:price><m:volume>270509</m:volume></m:order><m:order><m:symbol>TATGKH</m:symbol><m:buyerID>TJJKWU</m:buyerID><m:price>777544.01</m:price><m:volume>926882</m:volume></m:order><m:order><m:symbol>AHUNUG</m:symbol><m:buyerID>ZPDHRQ</m:buyerID><m:price>230472.12</m:price><m:volume>410520</m:volume></m:order><m:order><m:symbol>EDRKHF</m:symbol><m:buyerID>EKQTEM</m:buyerID><m:price>695154.62</m:price><m:volume>913544</m:volume></m:order><m:order><m:symbol>RBBNOH</m:symbol><m:buyerID>OALZLY</m:buyerID><m:price>904190.92</m:price><m:volume>248419</m:volume></m:order><m:order><m:symbol>LRSYVC</m:symbol><m:buyerID>VXKVGG</m:buyerID><m:price>807533.05</m:price><m:volume>135360</m:volume></m:order><m:order><m:symbol>ENXQKK</m:symbol><m:buyerID>KURWUN</m:buyerID><m:price>405090.93</m:price><m:volume>736104</m:volume></m:order><m:order><m:symbol>NTXFZQ</m:symbol><m:buyerID>QFMTYT</m:buyerID><m:price>160597.87</m:price><m:volume>520866</m:volume></m:order><m:order><m:symbol>GBUJRR</m:symbol><m:buyerID>RAKJDJ</m:buyerID><m:price>504160.90</m:price><m:volume>290016</m:volume></m:order><m:order><m:symbol>IYGXGK</m:symbol><m:buyerID>LQADYO</m:buyerID><m:price>709998.90</m:price><m:volume>407801</m:volume></m:order><m:order><m:symbol>YTNGYK</m:symbol><m:buyerID>WZXTJY</m:buyerID><m:price>214986.43</m:price><m:volume>661560</m:volume></m:order><m:order><m:symbol>DBPOQP</m:symbol><m:buyerID>PIAFJY</m:buyerID><m:price>315799.06</m:price><m:volume>236977</m:volume></m:order><m:order><m:symbol>JCYRFB</m:symbol><m:buyerID>AGEZMY</m:buyerID><m:price>066316.38</m:price><m:volume>587098</m:volume></m:order><m:order><m:symbol>FWIKKX</m:symbol><m:buyerID>XRIUUX</m:buyerID><m:price>537941.41</m:price><m:volume>773057</m:volume></m:order><m:order><m:symbol>CWEORG</m:symbol><m:buyerID>YOZXCA</m:buyerID><m:price>990404.94</m:price><m:volume>450690</m:volume></m:order><m:order><m:symbol>SCARYP</m:symbol><m:buyerID>IXXCMY</m:buyerID><m:price>101508.65</m:price><m:volume>000938</m:volume></m:order><m:order><m:symbol>KLOXHW</m:symbol><m:buyerID>CGSSVU</m:buyerID><m:price>904978.05</m:price><m:volume>926906</m:volume></m:order><m:order><m:symbol>YHRSLA</m:symbol><m:buyerID>DXPPEL</m:buyerID><m:price>169109.05</m:price><m:volume>648390</m:volume></m:order><m:order><m:symbol>AJFFBX</m:symbol><m:buyerID>HCLEYO</m:buyerID><m:price>913411.66</m:price><m:volume>843807</m:volume></m:order><m:order><m:symbol>BYCJWD</m:symbol><m:buyerID>YHAWDX</m:buyerID><m:price>784430.60</m:price><m:volume>967576</m:volume></m:order><m:order><m:symbol>EORFKM</m:symbol><m:buyerID>OHETPN</m:buyerID><m:price>425315.01</m:price><m:volume>457711</m:volume></m:order><m:order><m:symbol>CGEHVW</m:symbol><m:buyerID>ERTFNF</m:buyerID><m:price>300700.77</m:price><m:volume>062585</m:volume></m:order><m:order><m:symbol>LHRFSW</m:symbol><m:buyerID>WCTRLS</m:buyerID><m:price>003381.06</m:price><m:volume>612544</m:volume></m:order><m:order><m:symbol>MNODOO</m:symbol><m:buyerID>JEKRET</m:buyerID><m:price>994109.47</m:price><m:volume>007084</m:volume></m:order><m:order><m:symbol>KTFQWL</m:symbol><m:buyerID>WIQVDB</m:buyerID><m:price>642040.04</m:price><m:volume>205517</m:volume></m:order><m:order><m:symbol>KIJJYG</m:symbol><m:buyerID>QWLHAN</m:buyerID><m:price>670043.21</m:price><m:volume>401592</m:volume></m:order><m:order><m:symbol>ASEIHH</m:symbol><m:buyerID>HBXNOV</m:buyerID><m:price>806223.65</m:price><m:volume>405389</m:volume></m:order><m:order><m:symbol>WEIDLV</m:symbol><m:buyerID>EAXOZZ</m:buyerID><m:price>163311.72</m:price><m:volume>604308</m:volume></m:order><m:order><m:symbol>XERVHW</m:symbol><m:buyerID>EVNEUS</m:buyerID><m:price>484083.76</m:price><m:volume>455715</m:volume></m:order><m:order><m:symbol>BHORPQ</m:symbol><m:buyerID>LJQWSO</m:buyerID><m:price>048740.04</m:price><m:volume>982265</m:volume></m:order><m:order><m:symbol>YZIKJK</m:symbol><m:buyerID>NMWUUP</m:buyerID><m:price>247591.31</m:price><m:volume>107600</m:volume></m:order><m:order><m:symbol>OEFRJU</m:symbol><m:buyerID>KFUWHZ</m:buyerID><m:price>541056.34</m:price><m:volume>570598</m:volume></m:order><m:order><m:symbol>GDEIQC</m:symbol><m:buyerID>ZPFRAC</m:buyerID><m:price>386660.95</m:price><m:volume>729406</m:volume></m:order><m:order><m:symbol>HWQZUO</m:symbol><m:buyerID>DCADZJ</m:buyerID><m:price>748230.39</m:price><m:volume>868788</m:volume></m:order><m:order><m:symbol>PZZQLD</m:symbol><m:buyerID>NZLMQL</m:buyerID><m:price>290177.72</m:price><m:volume>900009</m:volume></m:order><m:order><m:symbol>TSMJFH</m:symbol><m:buyerID>AQPEHD</m:buyerID><m:price>028060.35</m:price><m:volume>128072</m:volume></m:order><m:order><m:symbol>OXFTJS</m:symbol><m:buyerID>DWHHVY</m:buyerID><m:price>666455.72</m:price><m:volume>008030</m:volume></m:order><m:order><m:symbol>PJKUNW</m:symbol><m:buyerID>QSKTIP</m:buyerID><m:price>306163.70</m:price><m:volume>746172</m:volume></m:order><m:order><m:symbol>WNYYLS</m:symbol><m:buyerID>FPVBEP</m:buyerID><m:price>029030.64</m:price><m:volume>050449</m:volume></m:order><m:order><m:symbol>LENSAW</m:symbol><m:buyerID>DBOOZB</m:buyerID><m:price>746177.37</m:price><m:volume>497521</m:volume></m:order><m:order><m:symbol>YCLXIL</m:symbol><m:buyerID>QABBEM</m:buyerID><m:price>649878.03</m:price><m:volume>307804</m:volume></m:order><m:order><m:symbol>EXMLRA</m:symbol><m:buyerID>CRGNJU</m:buyerID><m:price>825650.78</m:price><m:volume>849354</m:volume></m:order><m:order><m:symbol>PFKRLG</m:symbol><m:buyerID>YGBLAD</m:buyerID><m:price>430166.21</m:price><m:volume>807204</m:volume></m:order><m:order><m:symbol>TYJLMY</m:symbol><m:buyerID>BCZYSO</m:buyerID><m:price>559210.00</m:price><m:volume>474976</m:volume></m:order><m:order><m:symbol>TNEVCV</m:symbol><m:buyerID>BVDCGA</m:buyerID><m:price>290522.33</m:price><m:volume>335820</m:volume></m:order><m:order><m:symbol>WFOJZH</m:symbol><m:buyerID>PMYALG</m:buyerID><m:price>771155.01</m:price><m:volume>070044</m:volume></m:order><m:order><m:symbol>XZTIKT</m:symbol><m:buyerID>OLQBYM</m:buyerID><m:price>596931.10</m:price><m:volume>071700</m:volume></m:order><m:order><m:symbol>GXIZMD</m:symbol><m:buyerID>AYKIYW</m:buyerID><m:price>609432.19</m:price><m:volume>168009</m:volume></m:order><m:order><m:symbol>VUPKVK</m:symbol><m:buyerID>HODTVI</m:buyerID><m:price>256418.10</m:price><m:volume>358005</m:volume></m:order><m:order><m:symbol>VHTQEC</m:symbol><m:buyerID>MHZIUY</m:buyerID><m:price>035930.51</m:price><m:volume>973768</m:volume></m:order><m:order><m:symbol>HGQCXB</m:symbol><m:buyerID>XXAKKQ</m:buyerID><m:price>390120.99</m:price><m:volume>606661</m:volume></m:order><m:order><m:symbol>ZVYMQD</m:symbol><m:buyerID>SNFYOM</m:buyerID><m:price>137803.25</m:price><m:volume>545967</m:volume></m:order><m:order><m:symbol>MLGOGG</m:symbol><m:buyerID>FETBXH</m:buyerID><m:price>044560.45</m:price><m:volume>247042</m:volume></m:order><m:order><m:symbol>UJABLJ</m:symbol><m:buyerID>LSIMPX</m:buyerID><m:price>208603.53</m:price><m:volume>704936</m:volume></m:order><m:order><m:symbol>GQTEBH</m:symbol><m:buyerID>RFYHHU</m:buyerID><m:price>431301.98</m:price><m:volume>892135</m:volume></m:order><m:order><m:symbol>MZXEJR</m:symbol><m:buyerID>EJFTTZ</m:buyerID><m:price>400484.00</m:price><m:volume>174032</m:volume></m:order><m:order><m:symbol>TFLTRL</m:symbol><m:buyerID>PSAWNT</m:buyerID><m:price>823193.02</m:price><m:volume>160978</m:volume></m:order><m:order><m:symbol>JOKAIK</m:symbol><m:buyerID>YCEOFZ</m:buyerID><m:price>624702.61</m:price><m:volume>620947</m:volume></m:order><m:order><m:symbol>XPWWQH</m:symbol><m:buyerID>DAGNYW</m:buyerID><m:price>257146.00</m:price><m:volume>631578</m:volume></m:order><m:order><m:symbol>AIDYLV</m:symbol><m:buyerID>OQDAYW</m:buyerID><m:price>409641.31</m:price><m:volume>000449</m:volume></m:order><m:order><m:symbol>OFZRXT</m:symbol><m:buyerID>VXBEVB</m:buyerID><m:price>438985.68</m:price><m:volume>065900</m:volume></m:order><m:order><m:symbol>DPUWHZ</m:symbol><m:buyerID>AKABZM</m:buyerID><m:price>793218.10</m:price><m:volume>400010</m:volume></m:order><m:order><m:symbol>NUMODN</m:symbol><m:buyerID>PJQROU</m:buyerID><m:price>400854.34</m:price><m:volume>264078</m:volume></m:order><m:order><m:symbol>PCVKQU</m:symbol><m:buyerID>CMRPGZ</m:buyerID><m:price>592636.82</m:price><m:volume>306650</m:volume></m:order><m:order><m:symbol>NOLDYC</m:symbol><m:buyerID>EZKEUB</m:buyerID><m:price>884015.93</m:price><m:volume>252927</m:volume></m:order><m:order><m:symbol>BWYDLC</m:symbol><m:buyerID>YWWFZA</m:buyerID><m:price>106097.68</m:price><m:volume>259007</m:volume></m:order><m:order><m:symbol>IMMTWI</m:symbol><m:buyerID>QAFIOI</m:buyerID><m:price>109502.00</m:price><m:volume>168580</m:volume></m:order><m:order><m:symbol>ATITHK</m:symbol><m:buyerID>WLNPQR</m:buyerID><m:price>849054.73</m:price><m:volume>217023</m:volume></m:order><m:order><m:symbol>PFHSKG</m:symbol><m:buyerID>HUDLVO</m:buyerID><m:price>593906.73</m:price><m:volume>340033</m:volume></m:order><m:order><m:symbol>JMCJBN</m:symbol><m:buyerID>OWWWVG</m:buyerID><m:price>005165.03</m:price><m:volume>879110</m:volume></m:order></m:buyStocks></soapenv:Body></soapenv:Envelope>
