performance-tools/ravana/scenario/wso2esb-3.0.1_cbr/message512b.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"></soapenv:Header><soapenv:Body><m:buyStocks xmlns:m="http://po.services.core.carbon.wso2.org"><m:order><m:symbol>IBM</m:symbol><m:buyerID>asankha</m:buyerID><m:price>140.34</m:price><m:volume>200000</m:volume></m:order></m:buyStocks></soapenv:Body></soapenv:Envelope>
